[{
    "skillName": "C#",
    "description": "Primarily used during my time when I was a hobbyist Game Developer as the primary language in Unity."
},{
    "skillName": "JavaScript",
    "description": "Used during the development of an internal company project called Project Mars. My primary task there was to implement button functionalities and data handling. This includes simple page redirections, storing of session variables, and usage of 'fetch' to access APIs."
},{
    "skillName": "Next.JS",
    "description": "Used for the creation of this portfolio website. All four of NextJS, React, TypeScript, and Tailwind were all utilized in the creation of this website."
},{
    "skillName": "React.JS",
    "description": "Used for the creation of this portfolio website. All four of NextJS, React, TypeScript, and Tailwind were all utilized in the creation of this website."
},{
    "skillName": "TypeScript",
    "description": "Used for the creation of this portfolio website. All four of NextJS, React, TypeScript, and Tailwind were all utilized in the creation of this website."
},{
    "skillName": "Tailwind",
    "description": "Used for the creation of this portfolio website. All four of NextJS, React, TypeScript, and Tailwind were all utilized in the creation of this website."
},{
    "skillName": "SQL",
    "description": "Utilized during my college days on school projects and more recently, in my current full-time job. Being part of the Data Team in my current place of employment familiarized me with various data related technologies which incidentally includes SQL databases such as MySQL, Oracle, and PostgreSQL."
},{
    "skillName": "NoSQL",
    "description": "Introduced to me in my current place of employment. Being part of the Data Team, I was able to familiarize myself with NoSQL, particularly MongoDB as it is heavily utilized by our team."
},{
    "skillName": "HTML",
    "description": "Majority of my Web Development Experience came from using HTML with the mindset of being able to fully master the base language before taking on any frameworks. I've built a mock version of the old Facebook UI using base web development languages including HTML. I also built websites for school purposes, ranging from my own output, up to building websites for other students with compensation"
},{
    "skillName": "CSS",
    "description": "This was always used in any web development project I tackle, even this website that is primarily styled using Tailwind still uses native CSS for some niche and specific styling."
},{
    "skillName": "AJAX",
    "description": ""
},{
    "skillName": "Unity Game Engine",
    "description": "Used this game engine to create many game prototypes of game mechanics that I think would be interesting, however almost all has never seen the light of day since after producing said prototypes I tend to abandon the project in favor of a new idea. Except one project that I was able to put out a sort of Beta which is Mr. Dash, more details on that project can be found within the projects area of this website."
},{
    "skillName": "GODOT Game Engine",
    "description": "After a year and few months of using Unity, I wanted to expand my horizons on game engines. Initially, I aimed for Unreal Engine but found it too daunting of a task at the time so I've landed on a much simpler game engine, Godot. I've learned the basics of this game engine and even made a prototype of a game that has a time manipulation mechanic that is intertwined with the game's physics."
},{
    "skillName": "Git Source Control",
    "description": "This was never thought in university despite being one of the most important things that a developer should learn especially when working with teams. Due to that, I've familiarized myself with this technology in order to both preserve my projects as well as collaborate with others."
}]